//
//regular expression
//

//이메일
//(이메일 주소)@(도메인).(최상위 도메인 또는 TLD)
export const emailRegex = /^([a-zA-Z0-9_\-\.]+)@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.)|(([a-zA-Z0-9\-]+\.)+))([a-zA-Z]{2,4}|[0-9]{1,3})(\]?)$/;

//비밀번호
//영문 숫자 조합, 8글자 이상
export const passwordRegex = /^(?=.*[a-zA-Z])(?=.*[0-9]).{8,25}$/;

//이름
//10글자 이내 한글
export const nameRegex = /^[ㄱ-ㅎ가-힇]{1,10}$/;


//나이
//18이상 80이하 정수
export const ageRegex=/^(1{1}[8-9]{1}|[2-7]{1}[0-9]{1}|8{1}0{1})$/;

//키
//120이상 250이하 숫자, 소수점 첫째자리까지
export const heightRegex = /^(1{1}[2-9]{1}[0-9]{1}|2{1}[0-4]{1}[0-9]{1}|2{1}5{1}0{1})(\.{1}\d{0,1})?$/;

//몸무게
//30이상 200이하 숫자, 소수점 첫째자리까지
export const weightRegex = /^([3-9]{1}[0-9]{1}|1{1}[0-9]{2}|2{1}0{1}0{1})(\.{1}\d{0,1})?$/;

//섭취량
//1이상 3000이하 숫자, 소수점 첫째자리까지
export const servingRegex = /^([1-9]{1}|[1-9]{1}[0-9]{1}|[1-9]{1}[0-9]{2}|[1-2]{1}[0-9]{3}|3{1}0{1}0{1}0{1})(\.{1}\d{0,1})?$/